Repository: Sai-Santosh09/Daksh-2.0
Catalog: lib/l10n/app_*.arb
Languages: hi, te

# appTitle
source: Daksh
hi: दक्ष
te: దక్ష్

# welcomeMessage
source: Welcome to Daksh!
hi: दक्ष में आपका स्वागत है!
te: దక్ష్‌కు స్వాగతం!

source: Start Learning
hi: सीखना शुरू करें
te: నేర్చుకోవడం ప్రారంభించండి

source: Grammar Categories
hi: व्याकरण श्रेणियां
te: వ్యాకరణ వర్గాలు

source: Parts of Speech
hi: शब्द भेद
te: పదజాలం

# partsOfSpeechDescription
source: Learn about nouns, verbs, adjectives, and more.
hi: संज्ञा, क्रिया, विशेषण और अन्य के बारे में जानें।
te: నామవాచకాలు, క్రియలు, విశేషణాలు మరియు మరిన్ని గురించి తెలుసుకోండి.

source: Sentence Structure
hi: वाक्य संरचना
te: వాక్య నిర్మాణం

# sentenceStructureDescription
source: Master sentence formation and grammar rules.
hi: वाक्य निर्माण और व्याकरण नियमों में महारत हासिल करें।
te: వాక్య నిర్మాణం మరియు వ్యాకరణ నియమాలను నేర్చుకోండి.

source: Tenses
hi: काल
te: కాలాలు

# tensesDescription
source: Understand past, present, and future tenses.
hi: भूत, वर्तमान और भविष्य काल को समझें।
te: భూత, వర్తమాన మరియు భవిష్యత్ కాలాలను అర్థం చేసుకోండి.

source: Punctuation
hi: विराम चिह्न
te: విరామ చిహ్నాలు

# punctuationDescription
source: Learn proper punctuation usage.
hi: उचित विराम चिह्न का उपयोग सीखें।
te: సరైన విరామ చిహ్నాల వాడకాన్ని నేర్చుకోండి.

source: Recent Lessons
hi: हाल के पाठ
te: ఇటీవలి పాఠాలు

source: Lesson
hi: पाठ
te: పాఠం

source: Basic Grammar
hi: मूल व्याकरण
te: ప్రాథమిక వ్యాకరణం

source: Completed
hi: पूर्ण
te: పూర్తయింది

# daysAgo
source: {count, plural, =0{Today} =1{1 day ago} other{{count} days ago}}
hi: {count, plural, =0{आज} =1{1 दिन पहले} other{{count} दिन पहले}}
te: {count, plural, =0{ఈరోజు} =1{1 రోజు క్రితం} other{{count} రోజులు క్రితం}}

source: Learn
hi: सीखें
te: నేర్చుకోండి

source: Practice
hi: अभ्यास
te: అభ్యాసం

source: Assess
hi: मूल्यांकन
te: మూల్యాంకనం

source: Downloads
hi: डाउनलोड
te: డౌన్‌లోడ్‌లు

source: Settings
hi: सेटिंग्स
te: సెట్టింగ్‌లు

source: Search
hi: खोजें
te: వెతకండి

source: Search lessons
hi: पाठ खोजें
te: పాఠాలను వెతకండి

source: Practice Progress
hi: अभ्यास प्रगति
te: అభ్యాస పురోగతి

source: Exercises Completed
hi: पूर्ण अभ्यास
te: పూర్తయిన వ్యాయామాలు

source: Streak
hi: लगातार
te: వరుస

# days
source: {count, plural, =1{1 day} other{{count} days}}
hi: {count, plural, =1{1 दिन} other{{count} दिन}}
te: {count, plural, =1{1 రోజు} other{{count} రోజులు}}

source: Quick Practice
hi: त्वरित अभ्यास
te: త్వరిత అభ్యాసం

# quickPracticeDescription
source: Short exercises for daily practice
hi: दैनिक अभ्यास के लिए छोटे अभ्यास
te: రోజువారీ అభ్యాసానికి చిన్న వ్యాయామాలు

source: Focused Practice
hi: केंद्रित अभ्यास
te: కేంద్రీకృత అభ్యాసం

# focusedPracticeDescription
source: Target specific grammar areas
hi: विशिष्ट व्याकरण क्षेत्रों को लक्षित करें
te: నిర్దిష్ట వ్యాకరణ ప్రాంతాలను లక్ష్యంగా చేసుకోండి

source: Challenge Mode
hi: चुनौती मोड
te: సవాల్ మోడ్

# challengeModeDescription
source: Test your skills with difficult exercises
hi: कठिन अभ्यासों के साथ अपने कौशल का परीक्षण करें
te: కష్టమైన వ్యాయామాలతో మీ నైపుణ్యాలను పరీక్షించండి

source: Recent Practice
hi: हाल का अभ्यास
te: ఇటీవలి అభ్యాసం

source: Practice Session
hi: अभ्यास सत्र
te: అభ్యాస సెషన్

source: Score
hi: स्कोर
te: స్కోరు

source: Assessment Center
hi: मूल्यांकन केंद्र
te: మూల్యాంకన కేంద్రం

# testYourKnowledge
source: Test your grammar knowledge and track your progress with comprehensive assessments.
hi: अपने व्याकरण ज्ञान का परीक्षण करें और व्यापक मूल्यांकन के साथ अपनी प्रगति को ट्रैक करें।
te: మీ వ్యాకరణ జ్ఞానాన్ని పరీక్షించండి మరియు సమగ్ర మూల్యాంకనలతో మీ పురోగతిని ట్రాక్ చేయండి.

source: Current Level
hi: वर्तमान स्तर
te: ప్రస్తుత స్థాయి

source: Intermediate
hi: मध्यम
te: మధ్యస్థ

# basedOnPerformance
source: Based on your recent performance
hi: आपके हाल के प्रदर्शन के आधार पर
te: మీ ఇటీవలి పనితీరు ఆధారంగా

source: Available Assessments
hi: उपलब्ध मूल्यांकन
te: అందుబాటులో ఉన్న మూల్యాంకనలు

source: Quick Assessment
hi: त्वरित मूल्यांकन
te: త్వరిత మూల్యాంకనం

# quickAssessmentDescription
source: 5-10 minutes • Basic grammar knowledge
hi: 5-10 मिनट • मूल व्याकरण ज्ञान
te: 5-10 నిమిషాలు • ప్రాథమిక వ్యాకరణ జ్ఞానం

source: Comprehensive Test
hi: व्यापक परीक्षण
te: సమగ్ర పరీక్ష

# comprehensiveTestDescription
source: 30-45 minutes • Full grammar evaluation
hi: 30-45 मिनट • पूर्ण व्याकरण मूल्यांकन
te: 30-45 నిమిషాలు • పూర్తి వ్యాకరణ మూల్యాంకనం

source: Skill-Specific Test
hi: कौशल-विशिष्ट परीक्षण
te: నైపుణ్య-నిర్దిష్ట పరీక్ష

# skillSpecificTestDescription
source: 15-20 minutes • Focus on specific areas
hi: 15-20 मिनट • विशिष्ट क्षेत्रों पर ध्यान केंद्रित करें
te: 15-20 నిమిషాలు • నిర్దిష్ట ప్రాంతాలపై దృష్టి పెట్టండి

source: Start
hi: शुरू करें
te: ప్రారంభించండి

source: Choose Area
hi: क्षेत्र चुनें
te: ప్రాంతాన్ని ఎంచుకోండి

source: Recent Assessments
hi: हाल के मूल्यांकन
te: ఇటీవలి మూల్యాంకనలు

source: Storage Overview
hi: भंडारण अवलोकन
te: నిల్వ అవలోకనం

source: Downloaded Lessons
hi: डाउनलोड किए गए पाठ
te: డౌన్‌లోడ్ చేసిన పాఠాలు

source: Storage Used
hi: उपयोग किया गया भंडारण
te: వాడిన నిల్వ

source: Available for Download
hi: डाउनलोड के लिए उपलब्ध
te: డౌన్‌లోడ్ కోసం అందుబాటులో ఉంది

source: Complete Grammar Course
hi: पूर्ण व्याकरण पाठ्यक्रम
te: పూర్తి వ్యాకరణ కోర్సు

source: All lessons and exercises
hi: सभी पाठ और अभ्यास
te: అన్ని పాఠాలు మరియు వ్యాయామాలు

source: Practice Exercises Pack
hi: अभ्यास अभ्यास पैक
te: అభ్యాస వ్యాయామ ప్యాక్

source: Offline practice materials
hi: ऑफ़लाइन अभ्यास सामग्री
te: ఆఫ్‌లైన్ అభ్యాస సామగ్రి

source: Assessment Tests
hi: मूल्यांकन परीक्षण
te: మూల్యాంకన పరీక్షలు

source: Offline assessment materials
hi: ऑफ़लाइन मूल्यांकन सामग्री
te: ఆఫ్‌లైన్ మూల్యాంకన సామగ్రి

source: Size
hi: आकार
te: పరిమాణం

source: Downloaded
hi: डाउनलोड किया गया
te: డౌన్‌లోడ్ చేయబడింది

source: Download
hi: डाउनलोड करें
te: డౌన్‌లోడ్ చేయండి

source: Downloaded Content
hi: डाउनलोड की गई सामग्री
te: డౌన్‌లోడ్ చేసిన కంటెంట్

# downloadedOn
source: Downloaded {date}
hi: {date} को डाउनलोड किया गया
te: {date}న డౌన్‌లోడ్ చేయబడింది

source: Play
hi: चलाएं
te: ప్లే చేయండి

source: Delete
hi: हटाएं
te: తొలగించండి

source: Download Settings
hi: डाउनलोड सेटिंग्स
te: డౌన్‌లోడ్ సెట్టింగ్‌లు

source: Download over Wi-Fi only
hi: केवल वाई-फाई पर डाउनलोड करें
te: Wi-Fi మాత్రమే డౌన్‌లోడ్ చేయండి

# saveMobileData
source: Save mobile data by downloading only on Wi-Fi
hi: केवल वाई-फाई पर डाउनलोड करके मोबाइल डेटा बचाएं
te: Wi-Fi మాత్రమే డౌన్‌లోడ్ చేసి మొబైల్ డేటాను ఆదా చేయండి

source: Auto-download new content
hi: नई सामग्री को स्वचालित रूप से डाउनलोड करें
te: కొత్త కంటెంట్‌ను స్వయంచాలకంగా డౌన్‌లోడ్ చేయండి

# automaticallyDownloadNewLessons
source: Automatically download new lessons when available
hi: उपलब्ध होने पर नए पाठों को स्वचालित रूप से डाउनलोड करें
te: అందుబాటులో ఉన్నప్పుడు కొత్త పాఠాలను స్వయంచాలకంగా డౌన్‌లోడ్ చేయండి

source: Profile
hi: प्रोफ़ाइल
te: ప్రొఫైల్

source: App Settings
hi: ऐप सेटिंग्स
te: అనువర్తన సెట్టింగ్‌లు

source: Theme
hi: थीम
te: థీమ్

source: Light theme
hi: हल्की थीम
te: తేలికైన థీమ్

source: Language
hi: भाषा
te: భాష

source: Audio Settings
hi: ऑडियो सेटिंग्स
te: ఆడియో సెట్టింగ్‌లు

source: Sound effects and voice
hi: ध्वनि प्रभाव और आवाज़
te: ధ్వని ప్రభావాలు మరియు వాయిస్

source: Notifications
hi: सूचनाएं
te: నోటిఫికేషన్‌లు

source: Practice reminders
hi: अभ्यास अनुस्मारक
te: అభ్యాస గుర్తుకు తెచ్చేవి

source: Learning Preferences
hi: सीखने की प्राथमिकताएं
te: అభ్యాస ప్రాధాన్యతలు

source: Daily Goal
hi: दैनिक लक्ष्य
te: రోజువారీ లక్ష్యం

# minutesPerDay
source: {minutes} minutes per day
hi: प्रति दिन {minutes} मिनट
te: రోజుకు {minutes} నిమిషాలు

# everyDayAt
source: Every day at {time}
hi: हर दिन {time} बजे
te: ప్రతిరోజు {time}కు

source: Difficulty Level
hi: कठिनाई स्तर
te: కష్టత స్థాయి

# dataAndPrivacy
source: Data & Privacy
hi: डेटा और गोपनीयता
te: డేటా మరియు గోప్యత

source: Download Data
hi: डेटा डाउनलोड करें
te: డేటాను డౌన్‌లోడ్ చేయండి

# exportYourProgress
source: Export your learning progress
hi: अपनी सीखने की प्रगति निर्यात करें
te: మీ అభ్యాస పురోగతిని ఎగుమతి చేయండి

source: Delete Account
hi: खाता हटाएं
te: ఖాతాను తొలగించండి

# permanentlyDeleteAccount
source: Permanently delete your account
hi: अपना खाता स्थायी रूप से हटाएं
te: మీ ఖాతాను శాశ్వతంగా తొలగించండి

# supportAndInfo
source: Support & Info
hi: सहायता और जानकारी
te: మద్దతు మరియు సమాచారం

# helpAndSupport
source: Help & Support
hi: सहायता और समर्थन
te: సహాయం మరియు మద్దతు

source: Get help and contact support
hi: सहायता प्राप्त करें और समर्थन से संपर्क करें
te: సహాయం పొందండి మరియు మద్దతుతో సంప్రదించండి

source: About
hi: के बारे में
te: గురించి

# version
source: Version {version}
hi: संस्करण {version}
te: వెర్షన్ {version}

source: Rate App
hi: ऐप को रेट करें
te: అనువర్తనాన్ని రేట్ చేయండి

# rateUsOnAppStore
source: Rate us on the app store
hi: हमें ऐप स्टोर पर रेट करें
te: అనువర్తన స్టోర్‌లో మమ్మల్ని రేట్ చేయండి

source: Edit profile
hi: प्रोफ़ाइल संपादित करें
te: ప్రొఫైల్‌ను సవరించండి

source: Try Again
hi: फिर से कोशिश करें
te: మళ్లీ ప్రయత్నించండి

source: Page Not Found
hi: पृष्ठ नहीं मिला
te: పేజీ కనుగొనబడలేదు

# pageNotFoundMessage
source: Page not found: {location}
hi: पृष्ठ नहीं मिला: {location}
te: పేజీ కనుగొనబడలేదు: {location}

source: Go Home
hi: होम पर जाएं
te: హోమ్‌కు వెళ్లండి

source: Cancel
hi: रद्द करें
te: రద్దు చేయండి
